Revit 2027 API
RebarBarType.SetAutoCalculatedCrank Method
 Sets if the crank dimensions are auto calculated or not for the specified Rebar Crank Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAutoCalculatedCrank(
	ElementId rebarCrankTypeId,
	bool autoCalculated
)
Public Sub SetAutoCalculatedCrank (
	rebarCrankTypeId As ElementId,
	autoCalculated As Boolean
)
public:
void SetAutoCalculatedCrank(
	ElementId^ rebarCrankTypeId,
	bool autoCalculated
)
member SetAutoCalculatedCrank :
        rebarCrankTypeId : ElementId *
        autoCalculated : bool -> unit
Parameters
rebarCrankTypeId ElementId
 The Rebar Crank Type id. Interactions with Rebar Crank Types can be done with the functions in [!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils].
autoCalculated Boolean
 True, if the crank dimensions are auto calculated, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace